Revit 2026 API

# RebarShapeConstraintCircumference Properties

---

The RebarShapeConstraintCircumference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the diameter. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RebarShapeConstraint) |

#### Reference

RebarShapeConstraintCircumference Class

Autodesk.Revit.DB.Structure Namespace